v1912/run/DPMFoam/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        phi             phi.air;
        value           $internalField;
    }
    outlet
    {
        type            fixedFluxPressure;
        phi             phi.air;
        value           $internalField;
    }
    upperAtm
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    ground
    {
        type            fixedFluxPressure;
        phi             phi.air;
        value           $internalField;
    }
    frontAtm
    {
        type            cyclic;
    }
    backAtm
    {
        type            cyclic;
    }
}


// ************************************************************************* //
